In [2]:
# importing numpy and pandas
import numpy as np
import pandas as pd

In [3]:
# first working on user id data
user_data = open("user.dat","r").read()

In [4]:
# messy data in this file
user_data[:500]

'\x01\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00Saheba\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x01\x00\x00\x00\x00\x00\x00\x00\x001\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x02\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00Lokesh\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x01\x00\x00\x00\x00\x00\x00\x00\x002\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x03\x00\x0e\x00\x00\x00\x00\x00\x00\x00\x00Hemant\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x01\x00\x00\x00\x00\x00\x00\x00\x003\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x04\x00\x0e\x00\x00\x00\x00\x00\x00\x00\x00Abhishek\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x01\x00\x00\x00\x00\x00\x00\x00\x004\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x05\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00Kuldeep\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x01\x00\x00\x00\x00\x00\x00\x00\x005\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x06\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00Dev\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x01\x00\x00\x00\x00\x00\x00\x00\x006\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x07\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00Siddharth\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x01\x00\x00\x00\x00\x00\x00\x00\x007\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00'

In [5]:
# the file contain non ACSII and symboles that we dont need we are only keeping the data with numbers and char

a = ""
for i in user_data:
    if i.isalnum():
        a += i
    else:
        a += " "
a = a.split()

# variable a contain a list of name,id,name,id,name,id so we need 2 list name and id 
name = [a[i] for i in range(len(a)) if i%2==0]
user_id = [int(a[i]) for i in range(len(a)) if i%2==1]
print("name- ",name)
print("User id -",user_id)

# now converting this 2 list into one dictionary with id as key and name as value
user = dict(zip(user_id,name))
print("Updated data in a dict",user)

# converting that dictionary to data frame
user_df = pd.DataFrame(user.values(),index=user.keys())
user_df.reset_index(inplace=True)
user_df.rename(columns={0:"Name","index":"id"},inplace=True)

# our work has done we get the data of users in this variable
user_df

name-  ['Saheba', 'Lokesh', 'Hemant', 'Abhishek', 'Kuldeep', 'Dev', 'Siddharth', 'Ajay', 'Sachin', 'Varun', 'Priya', 'Bantu', 'Saloni', 'Priyanka', 'Govind', 'Purvi', 'Moiz', 'Gayatri', 'Shivangi', 'Aditi', 'Vaishali', 'Swarna', 'Devesh', 'Purnima', 'Arvind', 'Diksha', 'Santosh']
User id - [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
Updated data in a dict {1: 'Saheba', 2: 'Lokesh', 3: 'Hemant', 4: 'Abhishek', 5: 'Kuldeep', 6: 'Dev', 7: 'Siddharth', 8: 'Ajay', 9: 'Sachin', 10: 'Varun', 11: 'Priya', 12: 'Bantu', 13: 'Saloni', 14: 'Priyanka', 15: 'Govind', 16: 'Purvi', 17: 'Moiz', 18: 'Gayatri', 19: 'Shivangi', 20: 'Aditi', 21: 'Vaishali', 22: 'Swarna', 23: 'Devesh', 24: 'Purnima', 25: 'Arvind', 26: 'Diksha', 27: 'Santosh'}

    id       Name
0    1     Saheba
1    2     Lokesh
2    3     Hemant
3    4   Abhishek
4    5    Kuldeep
5    6        Dev
6    7  Siddharth
7    8       Ajay
8    9     Sachin
9   10      Varun
10  11      Priya
11  12      Bantu
12  13     Saloni
13  14   Priyanka
14  15     Govind
15  16      Purvi
16  17       Moiz
17  18    Gayatri
18  19   Shivangi
19  20      Aditi
20  21   Vaishali
21  22     Swarna
22  23     Devesh
23  24    Purnima
24  25     Arvind
25  26     Diksha
26  27    Santosh

In [6]:
user_df.to_csv("row user data.csv")

In [7]:
# this is the main file which has the attendance data and reading it in csv
df = pd.read_csv("attendance.dat",header=None)
df

                                              0
0            8\t2024-12-02 08:39:37\t1\t0\t1\t0
1            9\t2024-12-02 09:04:17\t1\t0\t1\t0
2           23\t2024-12-02 09:17:46\t1\t0\t1\t0
3           25\t2024-12-02 09:33:58\t1\t0\t1\t0
4           24\t2024-12-02 09:54:28\t1\t0\t1\t0
..                                          ...
438         26\t2024-12-31 10:29:05\t1\t0\t1\t0
439          4\t2024-12-31 10:44:18\t1\t0\t1\t0
440          1\t2024-12-31 10:50:33\t1\t0\t1\t0
441          5\t2024-12-31 10:59:04\t1\t0\t1\t0
442          9\t2024-12-31 15:05:15\t1\t0\t1\t0

[443 rows x 1 columns]

In [8]:
# because the data is in one column spliting it and keeping only the req. two columns so make these function that extract the data in first two columns

def get_id(text):
    return text.split("\t")[0]
def get_time(text):
    return text.split("\t")[1]

In [9]:
# creating two columns ID and punch_Time that hold the data when the employee punch in and out

df["id"]= df[0].map(get_id)
df["punch_time"] = df[0].map(get_time)
df.drop(columns=[0],inplace=True)   # deleting the raw data column and keeping only two column
df['id']= df["id"].astype(int)      # conerting id column to int

In [10]:
# now we get a clean data
df.head()
df.to_csv("raw attendance data.csv")

In [11]:
# merge the data of id and punch time data into one data frame

data = pd.merge(df,user_df,how="inner",on="id")

In [12]:
# Combined data
data.head()

   id           punch_time     Name
0   8  2024-12-02 08:39:37     Ajay
1   9  2024-12-02 09:04:17   Sachin
2  23  2024-12-02 09:17:46   Devesh
3  25  2024-12-02 09:33:58   Arvind
4  24  2024-12-02 09:54:28  Purnima

In [13]:
# extracting date and time 

data['datetime'] = pd.to_datetime(df['punch_time'])
data['date'] = pd.to_datetime(df['punch_time']).dt.date
data['in_out_time'] = pd.to_datetime(df['punch_time']).dt.time
data["am_pm"] = data['datetime'].dt.strftime("%p")
data.drop(columns="punch_time",inplace=True)     # no use of this column now
data.head()

   id     Name            datetime        date in_out_time am_pm
0   8     Ajay 2024-12-02 08:39:37  2024-12-02    08:39:37    AM
1   9   Sachin 2024-12-02 09:04:17  2024-12-02    09:04:17    AM
2  23   Devesh 2024-12-02 09:17:46  2024-12-02    09:17:46    AM
3  25   Arvind 2024-12-02 09:33:58  2024-12-02    09:33:58    AM
4  24  Purnima 2024-12-02 09:54:28  2024-12-02    09:54:28    AM

In [14]:
# we have only one column of IN and OUT time of employee , so making two columns to seperate them

ampm = data.pivot_table(index=data.index,columns='am_pm',values='datetime',aggfunc="min")
ampm.reset_index(inplace=True)
ampm.rename(columns={"index":"row_id"},inplace=True)
ampm.head()

am_pm  row_id                  AM  PM
0           0 2024-12-02 08:39:37 NaT
1           1 2024-12-02 09:04:17 NaT
2           2 2024-12-02 09:17:46 NaT
3           3 2024-12-02 09:33:58 NaT
4           4 2024-12-02 09:54:28 NaT

In [15]:
# merge both table into main data file

data = data.reset_index().rename(columns={"index":"row_id"})
data = pd.merge(data,ampm,how='left',on ='row_id')
data.head()

,row_id,id,Name,datetime,date,in_out_time,am_pm,AM,PM
0,0,8,Ajay,2024-12-02 08:39:37,2024-12-02,08:39:37,AM,2024-12-02 08:39:37,NaT
1,1,9,Sachin,2024-12-02 09:04:17,2024-12-02,09:04:17,AM,2024-12-02 09:04:17,NaT
2,2,23,Devesh,2024-12-02 09:17:46,2024-12-02,09:17:46,AM,2024-12-02 09:17:46,NaT
3,3,25,Arvind,2024-12-02 09:33:58,2024-12-02,09:33:58,AM,2024-12-02 09:33:58,NaT
4,4,24,Purnima,2024-12-02 09:54:28,2024-12-02,09:54:28,AM,2024-12-02 09:54:28,NaT

In [16]:
# importing timesheet of employee IN and OUT time

timesheet = pd.read_excel("timesheet.xlsx",sheet_name="time")
ts = timesheet[['Name','max late','max early']]

In [17]:
# merge time data to main dataframe

data = pd.merge(data,ts,how="left",on ='Name')
data.head()

,row_id,id,Name,datetime,date,in_out_time,am_pm,AM,PM,max late,max early
0,0,8,Ajay,2024-12-02 08:39:37,2024-12-02,08:39:37,AM,2024-12-02 08:39:37,NaT,2025-01-07 09:10:00,2025-01-07 17:50:00
1,1,9,Sachin,2024-12-02 09:04:17,2024-12-02,09:04:17,AM,2024-12-02 09:04:17,NaT,2025-01-07 09:10:00,2025-01-07 17:50:00
2,2,23,Devesh,2024-12-02 09:17:46,2024-12-02,09:17:46,AM,2024-12-02 09:17:46,NaT,2025-01-07 09:40:00,2025-01-07 17:50:00
3,3,25,Arvind,2024-12-02 09:33:58,2024-12-02,09:33:58,AM,2024-12-02 09:33:58,NaT,2025-01-07 09:40:00,2025-01-07 17:50:00
4,4,24,Purnima,2024-12-02 09:54:28,2024-12-02,09:54:28,AM,2024-12-02 09:54:28,NaT,2025-01-07 10:10:00,2025-01-07 18:20:00

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443 entries, 0 to 442
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   row_id       443 non-null    int64
 1   id           443 non-null    int64
 2   Name         443 non-null    object
 3   datetime     443 non-null    datetime64[ns]
 4   date         443 non-null    object
 5   in_out_time  443 non-null    object
 6   am_pm        443 non-null    object
 7   AM           236 non-null    datetime64[ns]
 8   PM           207 non-null    datetime64[ns]
 9   max late     443 non-null    datetime64[ns]
 10  max early    443 non-null    datetime64[ns]
dtypes: datetime64[ns](5), int64(2), object(4)
memory usage: 38.2+ KB

In [19]:
# converting datetime into time

data['max late'] = data['max late'].dt.time
data['max early'] = data['max early'].dt.time
data['AM'] = data['AM'].dt.time
data['PM'] = data['PM'].dt.time
data.head()

,row_id,id,Name,datetime,date,in_out_time,am_pm,AM,PM,max late,max early
0,0,8,Ajay,2024-12-02 08:39:37,2024-12-02,08:39:37,AM,08:39:37,NaT,09:10:00,17:50:00
1,1,9,Sachin,2024-12-02 09:04:17,2024-12-02,09:04:17,AM,09:04:17,NaT,09:10:00,17:50:00
2,2,23,Devesh,2024-12-02 09:17:46,2024-12-02,09:17:46,AM,09:17:46,NaT,09:40:00,17:50:00
3,3,25,Arvind,2024-12-02 09:33:58,2024-12-02,09:33:58,AM,09:33:58,NaT,09:40:00,17:50:00
4,4,24,Purnima,2024-12-02 09:54:28,2024-12-02,09:54:28,AM,09:54:28,NaT,10:10:00,18:20:00

In [20]:
# filling null values in AM column with max late and max early
data['AM'] = data['AM'].fillna(data['max late'])
data['PM'] = data['PM'].fillna(data['max early'])

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443 entries, 0 to 442
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   row_id       443 non-null    int64
 1   id           443 non-null    int64
 2   Name         443 non-null    object
 3   datetime     443 non-null    datetime64[ns]
 4   date         443 non-null    object
 5   in_out_time  443 non-null    object
 6   am_pm        443 non-null    object
 7   AM           443 non-null    object
 8   PM           443 non-null    object
 9   max late     443 non-null    object
 10  max early    443 non-null    object
dtypes: datetime64[ns](1), int64(2), object(8)
memory usage: 38.2+ KB

In [22]:
data['late_arival'] = data['AM']>data['max late']
data['early leave'] = data['PM']<data['max early']

In [23]:
late_data = data.groupby("Name").agg({"late_arival":"sum","early leave":"sum"})
late_data

          late_arival  early leave
Name
Abhishek            0            0
Aditi               0            1
Ajay                3            0
Arvind              0            0
Bantu               3            1
Dev                 8            2
Devesh              0            1
Diksha              0            1
Kuldeep             0            0
Purnima             0            1
Sachin              5            5
Saheba              0            1
Santosh             1            0

In [24]:
# 'ta' stand for total attendance a temprary variable 
ta = pd.DataFrame(data.groupby(["Name",'date'])['date'].count()).rename({"date":"count"},axis=1).reset_index()
ta.head()

       Name        date  count
0  Abhishek  2024-12-03      1
1  Abhishek  2024-12-04      2
2  Abhishek  2024-12-05      1
3  Abhishek  2024-12-06      1
4  Abhishek  2024-12-07      1

In [25]:
ta['present'] = 1
ta.head()

       Name        date  count  present
0  Abhishek  2024-12-03      1        1
1  Abhishek  2024-12-04      2        1
2  Abhishek  2024-12-05      1        1
3  Abhishek  2024-12-06      1        1
4  Abhishek  2024-12-07      1        1

In [26]:
total_present = pd.DataFrame(ta.groupby("Name")['date'].count())
total_present

          date
Name
Abhishek    24
Aditi        3
Ajay         8
Arvind      25
Bantu       23
Dev          9
Devesh      21
Diksha      24
Kuldeep     24
Purnima     22
Sachin      24
Saheba      24
Santosh      4

In [27]:
final = pd.merge(total_present,late_data,on='Name',how='left').reset_index()
# final

In [28]:
final.rename(columns={"date":"total_present_day"},inplace=True)

In [29]:
final['net_present_day']=final['total_present_day']-(final['late_arival']*0.5 + final['early leave']*0.5)
final

        Name  total_present_day  late_arival  early leave  net_present_day
0   Abhishek                 24            0            0             24.0
1      Aditi                  3            0            1              2.5
2       Ajay                  8            3            0              6.5
3     Arvind                 25            0            0             25.0
4      Bantu                 23            3            1             21.0
5        Dev                  9            8            2              4.0
6     Devesh                 21            0            1             20.5
7     Diksha                 24            0            1             23.5
8    Kuldeep                 24            0            0             24.0
9    Purnima                 22            0            1             21.5
10    Sachin                 24            5            5             19.0
11    Saheba                 24            0            1             23.5
12   Santosh                  4            1            0              3.5

In [30]:
leave_data = pd.read_excel("leave_data.xlsx")

In [31]:
leave_data = leave_data[['Name','Number of Days','Leave Start Date','Leave End Date']]

In [32]:
leave_data['half_name'] = leave_data['Name'].map(lambda x : x.split()[0].strip())

In [33]:
leave_data

,Name,Number of Days,Leave Start Date,Leave End Date,half_name
0,Devesh Patwa,5.0,2024-12-06,2024-12-10,Devesh
1,Purnima Khandelwal,1.0,2024-12-09,2024-12-09,Purnima
2,Purnima Khandelwal,1.0,2024-12-18,2024-12-18,Purnima
3,Aditi Chawda,0.5,2024-12-19,2024-12-19,Aditi
4,Aditi Chawda,1.0,2024-12-21,2024-12-21,Aditi
5,Purnima Khandelwal,1.0,2024-12-21,2024-12-21,Purnima
6,Aditi Chawda,0.5,2024-12-24,2024-12-24,Aditi
7,Diksha Rai,0.5,2024-12-26,2024-12-26,Diksha
8,Bantubala Patidar,2.0,2024-12-30,2024-12-31,Bantubala
9,Saheba Khan,1.0,2024-12-23,2024-12-23,Saheba

In [34]:
# counting datediff and excluding and sunday in between
def count_day_without_sunday(start_date,end_date):
    dates = pd.date_range(start=start_date,end=end_date)
    day = dates.day_name()
    day = day != "Sunday"
    return sum(day)

In [35]:
count_day_without_sunday("13-3-2025","18-3-2025")

np.int64(5)

In [36]:
leave_data['without sunday'] = leave_data.apply(lambda x: count_day_without_sunday(x['Leave Start Date'],x['Leave End Date']),axis=1)

In [37]:
leave_data['leave'] = leave_data.apply(lambda x: min(x['Number of Days'],x['without sunday']),axis=1)

In [38]:
leave_data

,Name,Number of Days,Leave Start Date,Leave End Date,half_name,without sunday,leave
0,Devesh Patwa,5.0,2024-12-06,2024-12-10,Devesh,4,4.0
1,Purnima Khandelwal,1.0,2024-12-09,2024-12-09,Purnima,1,1.0
2,Purnima Khandelwal,1.0,2024-12-18,2024-12-18,Purnima,1,1.0
3,Aditi Chawda,0.5,2024-12-19,2024-12-19,Aditi,1,0.5
4,Aditi Chawda,1.0,2024-12-21,2024-12-21,Aditi,1,1.0
5,Purnima Khandelwal,1.0,2024-12-21,2024-12-21,Purnima,1,1.0
6,Aditi Chawda,0.5,2024-12-24,2024-12-24,Aditi,1,0.5
7,Diksha Rai,0.5,2024-12-26,2024-12-26,Diksha,1,0.5
8,Bantubala Patidar,2.0,2024-12-30,2024-12-31,Bantubala,2,2.0
9,Saheba Khan,1.0,2024-12-23,2024-12-23,Saheba,1,1.0

In [39]:
# total leave taken by employees
total_leave = pd.DataFrame(leave_data.groupby('half_name')['leave'].sum()).reset_index()
total_leave

   half_name  leave
0      Aditi    2.0
1  Bantubala    2.0
2     Devesh    4.0
3     Diksha    0.5
4    Purnima    3.0
5     Saheba    1.0

In [40]:
# exporting total leave data to excel if you want
total_leave.to_csv("Total_leave.csv")

In [41]:
final

        Name  total_present_day  late_arival  early leave  net_present_day
0   Abhishek                 24            0            0             24.0
1      Aditi                  3            0            1              2.5
2       Ajay                  8            3            0              6.5
3     Arvind                 25            0            0             25.0
4      Bantu                 23            3            1             21.0
5        Dev                  9            8            2              4.0
6     Devesh                 21            0            1             20.5
7     Diksha                 24            0            1             23.5
8    Kuldeep                 24            0            0             24.0
9    Purnima                 22            0            1             21.5
10    Sachin                 24            5            5             19.0
11    Saheba                 24            0            1             23.5
12   Santosh                  4            1            0              3.5

In [42]:
final = pd.merge(final,total_leave,left_on='Name',right_on="half_name",how="left")

In [45]:
final.drop(columns="half_name",inplace=True)
final.rename({"leave":"Leave"},axis=1,inplace=True)
final['Leave']= final['Leave'].fillna(0)
final.to_csv("FinalReport.csv")

KeyError: "['half_name'] not found in axis"

In [46]:
final

,Name,total_present_day,late_arival,early leave,net_present_day,leave
0,Abhishek,24,0,0,24.0,NaN
1,Aditi,3,0,1,2.5,2.0
2,Ajay,8,3,0,6.5,NaN
3,Arvind,25,0,0,25.0,NaN
4,Bantu,23,3,1,21.0,NaN
5,Dev,9,8,2,4.0,NaN
6,Devesh,21,0,1,20.5,4.0
7,Diksha,24,0,1,23.5,0.5
8,Kuldeep,24,0,0,24.0,NaN
9,Purnima,22,0,1,21.5,3.0
10,Sachin,24,5,5,19.0,NaN
11,Saheba,24,0,1,23.5,1.0
12,Santosh,4,1,0,3.5,NaN